tap "osx-cross/avr"

cask_args appdir: "/Applications"

brew "ag"
brew "autoconf"
brew "automake"
brew "awscli"
brew "boost"
brew "cairo"
brew "cmake"
brew "colordiff"
brew "coreutils"
brew "czmq"
brew "dfu-programmer"
brew "docker"
brew "elixir"
brew "erlang"
brew "fribidi"
brew "gawk"
brew "gdbm"
brew "gettext"
brew "ghostscript"
brew "ghq"
brew "git"
brew "glib"
brew "glide"
brew "gmp"
brew "go"
brew "gobject-introspection"
brew "graphite2"
brew "harfbuzz"
brew "icu4c"
brew "imagemagick"
brew "imagemagick@6"
brew "jemalloc"
brew "jpeg"
brew "jq"
brew "libelf"
brew "libevent"
brew "libffi"
brew "libftdi0"
brew "libgpg-error"
brew "libidn2"
brew "libksba"
brew "libmpc"
brew "libogg"
brew "libpng"
brew "libtermkey"
brew "libtiff"
brew "libtool"
brew "libunistring"
brew "libusb"
brew "libusb-compat"
brew "libuv"
brew "libvorbis"
brew "libvterm"
brew "libyaml"
brew "little-cms2"
brew "luajit"
brew "makedepend"
brew "mas"
brew "mecab"
brew "mecab-ipadic"
brew "mpfr"
brew "msgpack"
brew "mysql"
brew "neovim"
brew "oniguruma"
brew "openssl"
brew "openssl@1.1"
brew "ossp-uuid"
brew "pango"
brew "pcre"
brew "pixman"
brew "pkg-config"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python"
brew "python@2"
brew "readline"
brew "redis"
brew "ricty", args: ["with-powerline"]
brew "ruby-build"
brew "source-highlight"
brew "sqlite"
brew "the_silver_searcher"
brew "tmux"
brew "unibilium"
brew "unixodbc"
brew "watch"
brew "watchman"
brew "wget"
brew "wxmac"
brew "xz"
brew "yarn --without-node", args: ["without-node"]
brew "zeromq"
brew "zsh"

# Oth"er Cask applications
cask "atom"
cask "java"
cask "macvim"
cask "vimr"
