tap "go-delve/delve"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "neovim/neovim"
tap "osx-cross/avr"
tap "px4/px4"
tap "rcmdnk/file"
tap "sanemat/font"
brew "autoconf"
brew "automake"
brew "avrdude"
brew "readline"
brew "xz"
brew "python"
brew "awscli"
brew "blueutil"
brew "pcre"
brew "cmake"
brew "colordiff"
brew "coreutils"
brew "czmq"
brew "dfu-programmer"
brew "direnv"
brew "docker", link: false
brew "elixir"
brew "libtool"
brew "fontforge"
brew "gawk"
brew "gcc"
brew "gcc@7"
brew "ghostscript"
brew "ghq"
brew "git"
brew "glide"
brew "pkg-config"
brew "imagemagick", link: false
brew "imagemagick@6", link: true
brew "jemalloc"
brew "jq"
brew "libevent"
brew "libidn2"
brew "libksba"
brew "libtermkey"
brew "libuv"
brew "libvorbis"
brew "libvterm"
brew "libyaml"
brew "luajit"
brew "makedepend"
brew "mas"
brew "mecab"
brew "mecab-ipadic"
brew "msgpack"
brew "mysql"
brew "unibilium"
brew "neovim"
brew "nginx"
brew "openssl@1.1"
brew "ossp-uuid"
brew "pyenv"
brew "pyenv-virtualenv"
brew "r"
brew "redis"
brew "ruby-build"
brew "source-highlight"
brew "terraform"
brew "the_silver_searcher"
brew "tmux"
brew "unixodbc"
brew "watch"
brew "watchman"
brew "wget"
brew "yarn", args: ["without-node"]
brew "zsh"
brew "osx-cross/avr/avr-gcc"
brew "px4/px4/gcc-arm-none-eabi"
brew "sanemat/font/ricty", args: ["with-powerline"]

cask "atom"
cask "macvim"
cask "java"
cask "xquartz"

